[
    {   
        "id": 0,
        "title": "Ten Amazing JavaScript Methods",
        "source": "https://shafiurrahmandiganta.medium.com/ten-amazing-javascript-methods-1b2c1b410387",
        "date": "May 5th, 2021",
        "description": "JavaScript is a programming language that is not only used on the client-side but also on the server-side. If we put it simply HTML and CSS give structure and style where JavaScript makes a website interactive..."
    },
    {   
        "id": 1,
        "title": "Some Topic on React",
        "source": "https://shafiurrahmandiganta.medium.com/some-things-on-react-dcb4b6e19010",
        "date": "May 7th, 2021",
        "description": "React is one of JavaScript’s more renowned library. It is mainly used for building user interfaces. To build something libraries aren’t exactly the go to solution. You will often need to use more libraries with react to form any solution. React follows the Unix philosophy because it..."
    },
    {   
        "id": 2,
        "title": "Difference Between forEach() and map()",
        "source": "https://shafiurrahmandiganta.medium.com/difference-between-foreach-and-map-15b4d1dc72de",
        "date": "Jun 1st, 2021",
        "description": "JavaScript has some really cool methods that help us iterate through arrays. The two most commonly used for iteration are map() and forEach() methods. Let’s first look at the definition of MDN: forEach() — executes a provided function once for each array element map() — creates..."
    },
    {   
        "id": 3,
        "title": "Ten Interesting Concepts of JavaScript",
        "source": "https://dev.to/diganta/ten-interesting-concepts-of-javascript-lh",
        "date": "May 6th, 2021",
        "description": "Here I have talked about some eye catching concepts of JavaScript like Error Handling, Cross Browser testing, Hoisting, Block Bindings in loops etc."
    },
    {   
        "id": 4,
        "title": "Important Interview Topics for JavaScript",
        "source": "https://shafiurrahmandiganta.medium.com/important-interview-topics-for-javascript-34d6044b8a35",
        "date": "May 8th, 2021",
        "description": "In this article I have discussed about some interview questions for Vanilla JavaScript. If you are a fresher or trying to get a entry level JavaScript developer job you can hop into this article."
    }
]